Repository: Doezer/scheduling-discord-bot
Catalog: res/messages_*.po
Languages: fr

source: Something went wrong with that command.
fr: Quelque chose n’allait pas avec cette commande.

source: The language is not available. Available languages: fr, en
fr: Ce langage n'est pas disponible. Langages disponibles : fr, en

source: You need to be moderator or administrator to do this.
fr: Vous devez être modérateur ou administrateur pour faire ça.

source: Scheduling bot - Help
fr: Bot de planification - Aide

source: Schedule a post (interactive mode).
fr: Planifier un post (mode interactif).

source: **{prompt}language <language>**
fr: **{prompt}language <langage>**

source: Set the bot language : "en" or "fr".
fr: Définit le langage du bot ("en" ou "fr")

source: Find below the explanation for all commands.
fr: Les commandes sont expliquées ci-après.

source: Please ID the channel in which you want to send your message:
fr: Merci de mentionner le canal dans lequel vous voulez envoyer le message :

source: Please post the message you want to send at a later date:
fr: Merci de poster le message que vous souhaitez planifier :

source: This is how your message will display (removing any everyone or here, make sure the bot has permissions if any has to be said)!
fr: C'est ainsi que votre message sera affiché (les everyone/here ont été désactivés par souci de confort). Vérifiez bien que vous avez toutes les permissions nécessaires !

source: Please confirm (Y/N) whether this is the message you want to send or not:
fr: Merci de confirmer (Y/N) que ce message vous va :

source: Scheduling cancelled.
fr: Planification annulée.

source: Please post the type of message you want : interval or date
fr: Merci d'indiquer le type de message que vous voulez envoyer : interval ou date

source: This type is not yet available. Use only for specific announcements for now.
fr: Ce type de planification n'est pas encore disponible.

source: Please post the date you want to send the message using this format : YYYY.MM.DD HH:mm
fr: Merci d'indiquer la date de planification en suivant ce format : YYYY.MM.DD HH:mm

source: I could not recognize the parameter
fr: Je n'ai pas reconnu ce paramètre.

source: Timeout!
fr: Vous avez pris trop de temps pour répondre.

source: Wrong format for date!
fr: Mauvais format pour la date.

source: Message will be posted in channel %s at date %s
fr: Le message sera posté dans le canal %s à la date suivante : %s.
